{
  "backend/main.mo": "Empty Motoko actor with no functionality.",
  "feature_evidence.json": "Feature evidence report describing a footer credit update and related files and components.",
  "frontend-file-summaries.txt": "Mapping of frontend file paths to short summaries of their purpose and behavior.",
  "frontend/index.css": "Tailwind base styles defining color tokens, theming variables, and global element styling.",
  "frontend/index.html": "Minimal HTML document loading the React app root and main script.",
  "frontend/src/App.tsx": "Renders the main CapClickerView and the CursorMotionTrail overlay.",
  "frontend/src/features/game/CapClickerView.tsx": "Full game UI layout handling stats, clicking, upgrade purchasing, animations, and number formatting.",
  "frontend/src/features/game/components/ClickFeedback.tsx": "Floating animated feedback element showing caps gained per click and auto-fading.",
  "frontend/src/features/game/components/CursorMotionTrail.tsx": "Canvas-based cursor trail effect that animates blur particles based on pointer velocity.",
  "frontend/src/features/game/components/SmoothScrollArea.tsx": "Custom scroll wrapper adding smooth animated wheel scrolling with reduced-motion support.",
  "frontend/src/features/game/components/UpgradeCard.tsx": "Displays an upgrade’s name, description, cost, level, and purchase button with affordability indicators.",
  "frontend/src/features/game/upgrades.ts": "Defines the Upgrade interface and lists click and automation upgrade configurations with costs and effects.",
  "frontend/src/features/game/useCapClickerGame.ts": "Implements game state management hook handling clicks, upgrade purchases, and idle cap generation.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on the user's Internet Identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication and stored credentials.",
  "frontend/src/hooks/usePrefersReducedMotion.ts": "Detects and tracks the user's reduced-motion preference via a media query.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file exporting nothing since the game uses only local state.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom theme tokens, including game-specific UI styling.",
  "frontend/src/lib/utils.ts": "Exports a utility function that merges class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Bootstraps the React app with Internet Identity and React Query providers.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, components, animations, and enabling plugins.",
  "project_state.json": "Defines the project’s state, including schema version, game summary, architectural notes, and a list of implemented features for the Cap Clicker game. Primarily serves as a manifest of completed features, metadata, and progression design details."
}