{
  "backend/main.mo": "Empty Motoko actor with no functionality.",
  "feature_evidence.json": "Feature evidence report listing features, related files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Mapping of frontend file paths to short descriptive summaries of their roles.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH theme variables, dark mode overrides, and global element styles.",
  "frontend/index.html": "Base HTML template mounting the React app root and loading the main script.",
  "frontend/src/App.tsx": "Main React component rendering the game view and cursor trail overlay.",
  "frontend/src/features/game/CapClickerView.tsx": "Core game UI combining stats, upgrades, click button, smooth scroll areas, and click feedback.",
  "frontend/src/features/game/components/ClickFeedback.tsx": "Floating animated feedback element showing cap gains at the click position.",
  "frontend/src/features/game/components/CursorMotionTrail.tsx": "Canvas-based cursor trail rendering motion blur with reduced‑motion support.",
  "frontend/src/features/game/components/SmoothScrollArea.tsx": "ScrollArea wrapper adding smooth wheel scrolling via requestAnimationFrame with reduced‑motion support.",
  "frontend/src/features/game/components/UpgradeCard.tsx": "UI component rendering an upgrade card with cost, level, effects, and purchase button styling and logic.",
  "frontend/src/features/game/upgrades.ts": "Defines the Upgrade interface and lists click and automation upgrade data with costs, scaling, and effects.",
  "frontend/src/features/game/useCapClickerGame.ts": "Hook managing clicker game state including caps, upgrades, costs, and idle generation loop.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider handling Internet Identity authentication lifecycle and exposing identity state and login/clear actions.",
  "frontend/src/hooks/usePrefersReducedMotion.ts": "Hook detecting and updating user reduced-motion preference.",
  "frontend/src/hooks/useQueries.ts": "Empty file indicating no backend queries are needed for the clicker game.",
  "frontend/src/index.css": "Tailwind base and component styles plus game-specific theme tokens and UI classes.",
  "frontend/src/lib/utils.ts": "Provides a utility function combining clsx and tailwind-merge for class name merging.",
  "frontend/src/main.tsx": "App entry point setting up React Query, Internet Identity provider, and rendering the root component.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom color tokens, extended shadows, animations, and plugin support for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing Cap Clicker’s features, state versioning, architectural notes, and a list of implemented game features and requirements."
}